package com.app.mtsapp;

import android.app.AlertDialog;
import android.app.Dialog;
import android.content.DialogInterface;
import android.os.Bundle;

import androidx.appcompat.app.AppCompatDialogFragment;

public class InfoPopup extends AppCompatDialogFragment {
    @Override
    public Dialog onCreateDialog(Bundle savedInstance) {
        AlertDialog.Builder builder = new AlertDialog.Builder(getActivity(), R.style.AppTheme);
        builder.setTitle("ПРАВИЛА ПОНАШАЊА")
                .setMessage("ЛОРЕМ ИПСУМ ДЕИ ЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ" +
                        " ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕ" +
                        "М ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОР" +
                        "ЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ И" +
                        "ПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ" +
                        " ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОР" +
                        "ЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛ" +
                        "ОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛ" +
                        "ОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИ" +
                        " ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕ" +
                        "М ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОР" +
                        "ЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ И" +
                        "ПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ" +
                        " ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОР" +
                        "ЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛ" +
                        "ОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛОРЕМ ИПСУМ ДЕИЛ")
                .setPositiveButton("ДОБРО", new DialogInterface.OnClickListener() {
                    @Override
                    public void onClick(DialogInterface dialog, int which) {

                    }
                });
        return builder.create();

    }
}
